In [137]:
#PANDAS - PYTHON DATA ANALYSIS LIBRARY 9/10/2019
import numpy as np
import pandas as pd

In [138]:
myList = ["a","b","c","d"]
myList

['a', 'b', 'c', 'd']

In [139]:
ser = pd.Series(myList)
ser

0    a
1    b
2    c
3    d
dtype: object

In [140]:
import pandas as pd
inx = ['I','II','III','IV']
ser = pd.Series(myList,inx)
ser

I      a
II     b
III    c
IV     d
dtype: object

In [141]:
tuple = ("a","b","c","d")
ser = pd.Series('tuple,inx')
ser

0    tuple,inx
dtype: object

In [142]:
list = ['a','b','c','d']
list * 2

['a', 'b', 'c', 'd', 'a', 'b', 'c', 'd']

In [143]:
ser = pd.Series(list)
ser*2

0    aa
1    bb
2    cc
3    dd
dtype: object

In [144]:
m1 = pd.Series([10,9],["Maths","Science"])
m2 = pd.Series([8,10],["Science","Maths"])
m1+m2

Maths      20
Science    17
dtype: int64

In [145]:
m1 = pd.Series([10,9],["Maths","science"])
m2 = pd.Series([8,10],["Geo","Maths"])
m1+m2

Geo         NaN
Maths      20.0
science     NaN
dtype: float64

## DATAFRAME

In [146]:
emp_df = {"emp_name":["Sam","Mike","Frodo","GIbbs"],"salary":[20000,25000,30000,28000]}
print(emp_df)
type(emp_df)

{'emp_name': ['Sam', 'Mike', 'Frodo', 'GIbbs'], 'salary': [20000, 25000, 30000, 28000]}

dict

In [147]:
# Accessing the data in table format
df = pd.DataFrame(emp_df,index=['a','b','c','d'])
df

  emp_name  salary
a      Sam   20000
b     Mike   25000
c    Frodo   30000
d    GIbbs   28000

In [148]:
# Accessing values or columns
df.emp_name

a      Sam
b     Mike
c    Frodo
d    GIbbs
Name: emp_name, dtype: object

In [149]:
df['emp_name'].values

array(['Sam', 'Mike', 'Frodo', 'GIbbs'], dtype=object)

In [150]:
#In array format
df.emp_name.values

array(['Sam', 'Mike', 'Frodo', 'GIbbs'], dtype=object)

## SLICING

In [151]:
#Slicing
df.head(2)

  emp_name  salary
a      Sam   20000
b     Mike   25000

In [152]:
df.tail(2)

  emp_name  salary
c    Frodo   30000
d    GIbbs   28000

In [153]:
df

  emp_name  salary
a      Sam   20000
b     Mike   25000
c    Frodo   30000
d    GIbbs   28000

In [154]:
#to identify middle value
df.loc[['b','c']]

  emp_name  salary
b     Mike   25000
c    Frodo   30000

In [155]:
#integer based position
df.iloc[1:3]

  emp_name  salary
b     Mike   25000
c    Frodo   30000

## MERGING

In [156]:
emp_df1 = pd.DataFrame({"emp_name":["sam","Mike","Frodo","Gibs"],"salary":[20000,25000,30000,28000]})
emp_df2 = pd.DataFrame({"emp_name":["sam","Mike","Frodo","Gibs"],"salary":[21000,25000,30000,28000]})
merg=pd.merge(emp_df1,emp_df2)
merg

  emp_name  salary
0     Mike   25000
1    Frodo   30000
2     Gibs   28000

In [157]:
merg = pd.merge(emp_df1,emp_df2,on="emp_name")
merg

  emp_name  salary_x  salary_y
0      sam     20000     21000
1     Mike     25000     25000
2    Frodo     30000     30000
3     Gibs     28000     28000

## JOINING

In [158]:
df1 = pd.DataFrame({"emp_name":["sam","Mike","Frodo","Gibs"],"salary":[20000,25000,30000,28000]},index=[1,2,3,4])
df2 = pd.DataFrame({"Leaves":[10,20,30,25]},index=[1,2,3,5])
jn = df1.join(df2)
jn

  emp_name  salary  Leaves
1      sam   20000    10.0
2     Mike   25000    20.0
3    Frodo   30000    30.0
4     Gibs   28000     NaN

In [160]:
#df (full join and inner join)

In [161]:
import numpy as np
import pandas as pd

In [162]:
updIndex = df1.set_index("emp_name")
updIndex

          salary
emp_name
sam        20000
Mike       25000
Frodo      30000
Gibs       28000

In [163]:
#to convert the index back to column
df.index = df["emp_name"]
df.head()

         emp_name  salary
emp_name
Sam           Sam   20000
Mike         Mike   25000
Frodo       Frodo   30000
GIbbs       GIbbs   28000

In [164]:
#CONCATENATION
df1

  emp_name  salary
1      sam   20000
2     Mike   25000
3    Frodo   30000
4     Gibs   28000

In [165]:
df2 = pd.DataFrame({"emp_name":["ram","john","joe","anil"],"salary":[20000,25000,30000,28000]})

In [166]:
conc = pd.concat((df1,df2))
conc

  emp_name  salary
1      sam   20000
2     Mike   25000
3    Frodo   30000
4     Gibs   28000
0      ram   20000
1     john   25000
2      joe   30000
3     anil   28000

In [167]:
conc.set_index('emp_name',inplace=True)
conc

          salary
emp_name
sam        20000
Mike       25000
Frodo      30000
Gibs       28000
ram        20000
john       25000
joe        30000
anil       28000

In [168]:
new_col = pd.DataFrame({'Address':['a','b','c','d','a','b','c','d']},index=["sam","Mike","Frodo","gibs","ram","john","joe","anil"])
conc2 = pd.concat((conc,new_col),axis = 1)

C:\Users\Parul\Anaconda3\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

In [169]:
conc2

        salary Address
Frodo  30000.0       c
Gibs   28000.0     NaN
Mike   25000.0       b
anil   28000.0       d
gibs       NaN       d
joe    30000.0       c
john   25000.0       b
ram    20000.0       a
sam    20000.0       a

In [170]:
data=pd.read_csv('C:\\Users\\Parul\\Desktop\\Datasets\\googleplaystore.csv')

In [171]:
data.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [172]:
data.tail()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
10836,Sya9a Maroc - FR,FAMILY,4.5,38,53M,"5,000+",Free,0,Everyone,Education,"July 25, 2017",1.48,4.1 and up
10837,Fr. Mike Schmitz Audio Teachings,FAMILY,5.0,4,3.6M,100+,Free,0,Everyone,Education,"July 6, 2018",1.0,4.1 and up
10838,Parkinson Exercices FR,MEDICAL,NaN,3,9.5M,"1,000+",Free,0,Everyone,Medical,"January 20, 2017",1.0,2.2 and up
10839,The SCP Foundation DB fr nn5n,BOOKS_AND_REFERENCE,4.5,114,Varies with device,"1,000+",Free,0,Mature 17+,Books & Reference,"January 19, 2015",Varies with device,Varies with device
10840,iHoroscope - 2018 Daily Horoscope & Astrology,LIFESTYLE,4.5,398307,19M,"10,000,000+",Free,0,Everyone,Lifestyle,"July 25, 2018",Varies with device,Varies with device

In [173]:
import pandas as pd
import numpy as np
 
# data frame 1
d1 = {'Customer_id':pd.Series([1,2,3,4,5,6]),
  'Product':pd.Series(['Oven','Oven','Oven','Television','Television','Television'])}
df1 = pd.DataFrame(d1)
 
 
# data frame 2
d2 = {'Customer_id':pd.Series([2,4,6]),
    'State':pd.Series(['California','California','Texas'])}
df2 = pd.DataFrame(d2)

In [174]:
df1

   Customer_id     Product
0            1        Oven
1            2        Oven
2            3        Oven
3            4  Television
4            5  Television
5            6  Television

In [175]:
df2

   Customer_id       State
0            2  California
1            4  California
2            6       Texas

In [193]:
#inner join in python pandas
print(pd.merge(df1, df2, on='Customer_id', how='inner'))

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [194]:
# outer join in python pandas
print(pd.merge(df1, df2, on='Customer_id', how='outer'))

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [196]:
# left join in python
print(pd.merge(df1, df2, on='Customer_id', how='left'))

   Customer_id     Product       State
0            1        Oven         NaN
1            2        Oven  California
2            3        Oven         NaN
3            4  Television  California
4            5  Television         NaN
5            6  Television       Texas

In [195]:
# right join in python pandas
print(pd.merge(df1, df2, on='Customer_id', how='right'))

   Customer_id     Product       State
0            2        Oven  California
1            4  Television  California
2            6  Television       Texas

In [218]:
# full outer joint
import pandas as pd
world_champions={'Team':['India','Australia','WestIndies','Pakistan','Sri Lanka'],'ICC_rank':[2,3,7,8,4],
'World_champions_Year':[2011,2015,1979,1992,1996],'Points':[874,787,753,673,855]}
chokers={'Team':['South Africa','NewZealand','Zimbabwe'],'ICC_rank':[1,5,9],'Points':[895,764,656]}
df1=pd.DataFrame(world_champions)
df2=pd.DataFrame(chokers)
print(pd.merge(df1,df2,on='Team',how='outer'))

           Team  ICC_rank_x  World_champions_Year  Points_x  ICC_rank_y  \
0         India         2.0                2011.0     874.0         NaN
1     Australia         3.0                2015.0     787.0         NaN
2    WestIndies         7.0                1979.0     753.0         NaN
3      Pakistan         8.0                1992.0     673.0         NaN
4     Sri Lanka         4.0                1996.0     855.0         NaN
5  South Africa         NaN                   NaN       NaN         1.0
6    NewZealand         NaN                   NaN       NaN         5.0
7      Zimbabwe         NaN                   NaN       NaN         9.0

   Points_y
0       NaN
1       NaN
2       NaN
3       NaN
4       NaN
5     895.0
6     764.0
7     656.0

In [186]:
# Changing index to column
df

         emp_name  salary
emp_name
Sam           Sam   20000
Mike         Mike   25000
Frodo       Frodo   30000
GIbbs       GIbbs   28000

In [185]:
updIndex=df.set_index('emp_name')
updIndex

          salary
emp_name
Sam        20000
Mike       25000
Frodo      30000
GIbbs      28000

In [187]:
df.index = df["emp_name"]
df.head()

         emp_name  salary
emp_name
Sam           Sam   20000
Mike         Mike   25000
Frodo       Frodo   30000
GIbbs       GIbbs   28000

In [191]:
df

         emp_name  salary
emp_name
Sam           Sam   20000
Mike         Mike   25000
Frodo       Frodo   30000
GIbbs       GIbbs   28000

### CONCATENATION

In [197]:
df1 = pd.DataFrame({"emp":["Sam","Mike","Frodo","Gibs",],"Salary":[20000,25000,30000,28000]})

In [198]:
df1

     emp  Salary
0    Sam   20000
1   Mike   25000
2  Frodo   30000
3   Gibs   28000

In [201]:
df2 = pd.DataFrame({"emp":["Mary","Leo","Dan","David"],"Salary":[2000,25000,30000,28000]})
df2

     emp  Salary
0   Mary    2000
1    Leo   25000
2    Dan   30000
3  David   28000

In [202]:
conc = pd.concat((df1,df2))
conc

     emp  Salary
0    Sam   20000
1   Mike   25000
2  Frodo   30000
3   Gibs   28000
0   Mary    2000
1    Leo   25000
2    Dan   30000
3  David   28000

In [203]:
#Concatenating columns
new_col = pd.DataFrame({'Address':['a','b','c','d']})
new_col.head()

  Address
0       a
1       b
2       c
3       d

In [204]:
conc = pd.concat((df,new_col),axis = 1)
conc

      emp_name   salary Address
0          NaN      NaN       a
1          NaN      NaN       b
2          NaN      NaN       c
3          NaN      NaN       d
Frodo    Frodo  30000.0     NaN
GIbbs    GIbbs  28000.0     NaN
Mike      Mike  25000.0     NaN
Sam        Sam  20000.0     NaN

In [208]:
data=pd.read_csv('C:/Users/Parul/Desktop/Datasets/googleplaystore.csv')

In [209]:
data.head()

,App,Category,Rating,Reviews,Size,Installs,Type,Price,Content Rating,Genres,Last Updated,Current Ver,Android Ver
0,Photo Editor & Candy Camera & Grid & ScrapBook,ART_AND_DESIGN,4.1,159,19M,"10,000+",Free,0,Everyone,Art & Design,"January 7, 2018",1.0.0,4.0.3 and up
1,Coloring book moana,ART_AND_DESIGN,3.9,967,14M,"500,000+",Free,0,Everyone,Art & Design;Pretend Play,"January 15, 2018",2.0.0,4.0.3 and up
2,"U Launcher Lite – FREE Live Cool Themes, Hide ...",ART_AND_DESIGN,4.7,87510,8.7M,"5,000,000+",Free,0,Everyone,Art & Design,"August 1, 2018",1.2.4,4.0.3 and up
3,Sketch - Draw & Paint,ART_AND_DESIGN,4.5,215644,25M,"50,000,000+",Free,0,Teen,Art & Design,"June 8, 2018",Varies with device,4.2 and up
4,Pixel Draw - Number Art Coloring Book,ART_AND_DESIGN,4.3,967,2.8M,"100,000+",Free,0,Everyone,Art & Design;Creativity,"June 20, 2018",1.1,4.4 and up

In [207]:
data.shape

(10841, 13)

In [ ]:
#Reading csv(comma separated value) , tsv(tab separated value), xlsx, .data